/**
 *  @file I2C_Port.c
 *
 *  @date 2021-03-05
 *
 *  @author aron566
 *
 *  @copyright 爱谛科技研究院.
 *
 *  @brief I2C中断调度接口
 *
 *  @details 1、
 *
 *  @version V1.0
 */
#ifdef __cplusplus ///<use C compiler
extern "C" {
#endif
/** Includes -----------------------------------------------------------------*/
/* Private includes ----------------------------------------------------------*/
#include "I2C_Port.h"
#include "main.h"
/** Private typedef ----------------------------------------------------------*/
/** Private macros -----------------------------------------------------------*/
/** Private constants --------------------------------------------------------*/
/** Public variables ---------------------------------------------------------*/
/** Private variables --------------------------------------------------------*/

/** Private function prototypes ----------------------------------------------*/

/** Private user code --------------------------------------------------------*/

/** Private application code -------------------------------------------------*/
/*******************************************************************************
*
*       Static code
*
********************************************************************************
*/

/** Public application code --------------------------------------------------*/
/*******************************************************************************
*
*       Public code
*
********************************************************************************
*/
/**
  ******************************************************************
  * @brief   I2C发送完成回调
  * @param   [in]hi2c 句柄
  * @return  None.
  * @author  aron566
  * @version V1.0
  * @date    2021-03-05
  ******************************************************************
  */
void HAL_I2C_MasterTxCpltCallback(I2C_HandleTypeDef *hi2c)
{
  if(hi2c->Instance == I2C2)
  {
    Voltameter_Port_I2C_MasterTxCpltCallback();
  }
}

/**
  ******************************************************************
  * @brief   I2C接收完成回调
  * @param   [in]hi2c 句柄
  * @return  None.
  * @author  aron566
  * @version V1.0
  * @date    2021-03-05
  ******************************************************************
  */
void HAL_I2C_MasterRxCpltCallback(I2C_HandleTypeDef *hi2c)
{
  if(hi2c->Instance == I2C2)
  {
    Voltameter_Port_I2C_MasterRxCpltCallback();
  }
}

#ifdef __cplusplus ///<end extern c
}
#endif
/******************************** End of file *********************************/
