/**
 *  @file LED_Port.c
 *
 *  @date 2021-01-01
 *
 *  @author aron566
 *
 *  @copyright 爱谛科技研究院.
 *
 *  @brief led操作接口
 *
 *  @details 1、
 *
 *  @version V1.0
 */
#ifdef __cplusplus ///<use C compiler
extern "C" {
#endif
/** Includes -----------------------------------------------------------------*/
/* Private includes ----------------------------------------------------------*/
#include "LED_Port.h"
#include "main.h"
/** Private typedef ----------------------------------------------------------*/

/** Private macros -----------------------------------------------------------*/

/** Private constants --------------------------------------------------------*/
/** Public variables ---------------------------------------------------------*/
/** Private variables --------------------------------------------------------*/

/** Private function prototypes ----------------------------------------------*/

/** Private user code --------------------------------------------------------*/

/** Private application code -------------------------------------------------*/
/*******************************************************************************
*
*       Static code
*
********************************************************************************
*/

/** Public application code --------------------------------------------------*/
/*******************************************************************************
*
*       Public code
*
********************************************************************************
*/

/**
  ******************************************************************
  * @brief   打开TP LED
  * @param   [in]None
  * @return  None.
  * @author  aron566
  * @version V1.0
  * @date    2021-01-07
  ******************************************************************
  */
void LED_Port_Set_TP_Open(void)
{
  HAL_GPIO_WritePin(TP_GPIO_Port, TP_Pin, GPIO_PIN_SET);
}

/**
  ******************************************************************
  * @brief   关闭TP LED
  * @param   [in]None
  * @return  None.
  * @author  aron566
  * @version V1.0
  * @date    2021-01-07
  ******************************************************************
  */
void LED_Port_Set_TP_Close(void)
{
  HAL_GPIO_WritePin(TP_GPIO_Port, TP_Pin, GPIO_PIN_RESET);
}

/**
  ******************************************************************
  * @brief   闪烁LED
  * @param   [in]Led_Num LED号 0-3，other will be Off
  * @return  None.
  * @author  aron566
  * @version V1.0
  * @date    2021-05-10
  ******************************************************************
  */
void LED_Toggle_LED(uint8_t Led_Num)
{
  switch(Led_Num)
  {
    case 0:
    case 1:
    case 2:
    case 3:
      break;
    default:
      break;
  }
}

#ifdef __cplusplus ///<end extern c
}
#endif
/******************************** End of file *********************************/
