/**
 *  @file TP_Port.c
 *
 *  @date 2022-3-28
 *
 *  @author pzq
 *
 *  @brief TP_Port
 *
 *  @details 
 *
 *  @version V1.0
 */
#ifdef __cplusplus ///<use C compiler
extern "C" {
#endif
/** Includes -----------------------------------------------------------------*/
/* Private includes ----------------------------------------------------------*/
#include "TP_Port.h"
#include "gpio.h"

extern void chsc6x_init(void);
extern void chsc6x_read_touch_info(void);

/** Private typedef ----------------------------------------------------------*/
/** Private macros -----------------------------------------------------------*/
																										
/** Private constants --------------------------------------------------------*/
/** Public variables ---------------------------------------------------------*/

/** Private variables --------------------------------------------------------*/


/** Private function prototypes ----------------------------------------------*/

/** Private user code --------------------------------------------------------*/

/** Private application code -------------------------------------------------*/
/*******************************************************************************
*
*       Static code
*
********************************************************************************
*/

/** Public application code --------------------------------------------------*/
/*******************************************************************************
*
*       Public code
*
********************************************************************************
*/
/**
 * @brief 触摸屏初始化
 *
 *
 */
void TP_Port_Init(void)
{
  chsc6x_init();
}

/**
 * @brief 触摸屏中断回调函数
 *
 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	 if(GPIO_Pin == TP_EINT_Pin)
	 {
			chsc6x_read_touch_info();;
	 }
}

#ifdef __cplusplus ///<end extern c
}
#endif
/******************************** End of file *********************************/
