 /**
  *  @file lv_port.c
  *
  *  @date 2021-02-7
  *
  *  @author zgl
  *
  *  @copyright None.
  *
  *  @brief
  *
  *  @details 
  *
  *  @version V1.0
  */
 #ifdef __cplusplus ///<use C compiler
 extern "C" {
 #endif
 /** Includes -----------------------------------------------------------------*/
 /* Private includes ----------------------------------------------------------*/
 #include "lv_port.h"
 #include "lv_port_disp.h"
 #include "lv_port_indev.h"
 /** Private typedef ----------------------------------------------------------*/
 /** Private macros -----------------------------------------------------------*/
 /** Private constants --------------------------------------------------------*/
 /** Public variables ---------------------------------------------------------*/
 /** Private variables --------------------------------------------------------*/

 /** Private function prototypes ----------------------------------------------*/

 /** Private user code --------------------------------------------------------*/

 /** Private application code -------------------------------------------------*/
 /*******************************************************************************
 *
 *       Static code
 *
 ********************************************************************************
 */

 /** Public application code --------------------------------------------------*/
 /*******************************************************************************
 *
 *       Public code
 *
 ********************************************************************************
 */
/**
 * @brief lITTLEvgl初始化
 *
 */
void LV_Init(void)
{
  /* littleVGL初始化 */
  lv_init();

  /* littleVGL显示初始化 */
  lv_port_disp_init();

  /* littleVGL触摸初始化 */
  lv_port_indev_init();
}

/**
 * @brief lITTLEvgl启动
 *
 */
void LV_Task_Start(void)
{
  lv_task_handler();
}
 #ifdef __cplusplus ///<end extern c
 }
 #endif
/******************************** End of file *********************************/
