/**
 *  @file cm_backtrace_port.c
 *
 *  @date 2021/2/6
 *
 *  @author aron566
 *
 *  @copyright None.
 *
 *  @brief 错误追踪库接口
 *
 *  @details 1、添加两个目录到工程（port和src），分别放置源文件和接口文件
 *           2、根据平台信息配置cmb_cfg.h
 *           3、根据IDE选择port目录下的汇编文件，并屏蔽原始hardfault中断函数
 *           4、调用本接口初始化函数即可。
 *
 *  @version v1.0
 */
#ifdef __cplusplus ///<use C compiler
extern "C" {
#endif
/** Includes -----------------------------------------------------------------*/
/* Private includes ----------------------------------------------------------*/
#include "cm_backtrace_port.h"

/** Private typedef ----------------------------------------------------------*/
/** Private macros -----------------------------------------------------------*/
#define FIRMWARE_NAME "STM32H743VIT6_Aids_CDC"
#define HARDWARE_VER  "V2.1"
#define SOFTWARE_VER  "V1.0"

/** Private constants --------------------------------------------------------*/
/** Public variables ---------------------------------------------------------*/
/** Private variables --------------------------------------------------------*/
/** Private function prototypes ----------------------------------------------*/
/** Private user code --------------------------------------------------------*/

/** Private application code -------------------------------------------------*/
/*******************************************************************************
*
*       Static code
*
********************************************************************************
*/
/** Public application code --------------------------------------------------*/
/*******************************************************************************
*
*       Public code
*
********************************************************************************
*/

/**
  ******************************************************************
  * @brief   错误追踪库接口初始化
  * @param   [in]None
  * @return  None.
  * @author  aron566
  * @version v1.0
  * @date    2021/2/6
  ******************************************************************
  */
void CM_Backtrace_Port_Init(void)
{
  cm_backtrace_init(FIRMWARE_NAME, HARDWARE_VER, SOFTWARE_VER);
}

#ifdef __cplusplus ///<end extern c
}
#endif
/******************************** End of file *********************************/
